cases/Flow/DBSFlowCase-Pore-Darcy/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       19800;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       39800;
    }
    bottom
    {
        type            patch;
        nFaces          100;
        startFace       39900;
    }
    left
    {
        type            patch;
        nFaces          100;
        startFace       40000;
    }
    right
    {
        type            patch;
        nFaces          100;
        startFace       40100;
    }
)

// ************************************************************************* //
